insert into UserAccount values();

insert into HotelInfo values(1 ,'杭州法云安缦酒店','浙江','杭州','西湖区',5,'法云安缦位于西湖西侧的山谷之间，沿路两旁竹林密布、草草木青翠，经过植物园和西湖内部水路，便来到天竺寺和天竺古村落。法云安缦位于西湖西侧的山谷之间，距杭州市中心20分钟车程。沿路两旁竹林密布、草草木青翠，经过植物园和西湖内部水路，便来到天竺寺和天竺古村落。法云安缦即坐落于天竺古村另一侧，北高峰之麓，毗邻灵隐寺和永福寺。此处包括周围茶园在内，占地面积共计14公顷。 此处共有47处居所，始建于唐朝，曾为附近茶园村民所住。 度假酒店的主干道—法云径连接所有客房（庭院住宅）和酒店设施。这里的住宅可追溯至百年以前，如今以传统作法和工艺修缮一新，砖墙瓦顶，土木结构，屋内走道和地板均为石材铺置。','0571-87329999',0.85,4.5,8);
insert into HotelInfo values(2 ,'杭州西溪悦榕庄','浙江','杭州','西湖区',5,'杭州西溪悦榕庄被葱郁的树木和宁静的湖水簇拥，拥有杭州最宽敞豪华的客房，浓墨重彩于大自然之回归，流溢着无限幽雅静谧之韵。探索江南风情的“水村”度假村体验，位于中国第一个湿地保护区——西溪国家湿地公园畔。湿地公园内有数不尽的植被物种，随处可见的自然生态。 从各套房与别墅的灰瓦屋顶、象牙色墙到室内的精妙设计，杭州西溪悦榕庄处处彰显了传统的中式建筑与现代装饰的完美结合，与周围静谧幽雅的自然环境融为一体。 探寻杭州西溪悦榕庄的无限幽雅静谧，体验古韵的浪漫。','0571-85860000',1.00,4.3,3);
insert into HotelInfo values(3 ,'杭州西子湖四季酒店','浙江','杭州','西湖区',5,'坐落于杭州西子湖畔的四季酒店，地理位置十分优越，紧邻商务、娱乐及购物中心，交通四通八达。坐落于杭州西子湖畔的四季酒店，地理位置十分优越，紧邻商务、娱乐及购物中心，交通四通八达。','0571-88298888',0.80,3.9,10);
insert into HotelInfo values(4 ,'深圳途家斯维登度假别墅东部华侨城店','广东','深圳','盐田区',5,'性价比高，住宿环境、通风采光较好。','0755-22726360',0.5,2.8,3);

insert into RoomInfo values(1, '村庄客舍房', '2016/05/10', 12, 4772.0);
insert into RoomInfo values(1, '村庄套房', '2016/05/10', 8, 4835.0);
insert into RoomInfo values(1, '豪华村庄套房', '2016/05/10', 4, 5359.0);
insert into RoomInfo values(1, '豪华村庄套房', '2016/05/11', 6, 5423.0);
insert into RoomInfo values(1, '豪华村庄套房', '2016/05/12', 7, 6243.0);

insert into RoomInfo values(1, '村庄别墅', '2016/05/10', 2, 100);
insert into RoomInfo values(1, '村庄别墅', '2016/05/11', 6, 200);
insert into RoomInfo values(1, '村庄别墅', '2016/05/12', 0, 200);
insert into RoomInfo values(1, '法云安缦别墅', '2016/05/10', 1, 14173.0);

insert into RoomInfo values(2, '水悦阁套房', '2016/05/10', 12, 2682.0);
insert into RoomInfo values(2, '豪华水悦别墅', '2016/05/10', 12, 4096.0);
insert into RoomInfo values(2, '泉浴按摩池别墅', '2016/05/10', 12, 5658.0);
insert into RoomInfo values(2, '总统三卧室别墅', '2016/05/10', 12, 57500.0);

insert into RoomType values(1,'豪华村庄套房','适合pppaaa',10);
insert into RoomType values(1,'村庄别墅','适合ppp',10);
insert into RoomType values(2,'泉浴按摩池别墅','真舒服！',10);

insert into TicketsInfo values(null,'GB-123', '杭州', '北京', '深圳', '2016-6-1 13:00','2016-6-1 13:40' ,'2016-6-1 14:30', 230, 230, 480,1.0);
